app/views/admin/clubs/membership_types/_form.html.erb

SELECT 1 AS one FROM "club_default_price_tiers" WHERE "club_default_price_tiers"."club_id" = 'cb3913b7-a251-451c-ac89-09c59a024137' LIMIT 1
---

    <% if membership_type.new_record? && club.default_price_tiers.any? %>