app/views/members/checkouts/success.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = '1061fc1b-3eba-427f-a0a5-fa3b7ef652de'
---

      <% if @order.order_items.any? %>