app/controllers/admin/audits_controller.rb

  def index
    @audits = defined?(Audited::Audit) ? Audited::Audit.order(created_at: :desc).limit(200) : []
---
SELECT "audits".* FROM "audits" ORDER BY "audits"."created_at" DESC LIMIT 200