app/controllers/admin/broadcasts_controller.rb

SELECT "broadcasts".* FROM "broadcasts" ORDER BY "broadcasts"."created_at" DESC LIMIT 100
---
  def index
    @broadcasts = Broadcast.includes(:club).order(created_at: :desc).limit(100)