app/controllers/admin/clubs_controller.rb

  def index
    @clubs = Club.includes(:members).order(:name)
---
SELECT "clubs".* FROM "clubs" ORDER BY "clubs"."name" ASC
SELECT "members".* FROM "members" WHERE "members"."club_id" IN ('cb3913b7-a251-451c-ac89-09c59a024137', '81527be2-fd17-46eb-9a97-037af14f24f8')

  def show
    @members_count = @club.members.count
    @invoices_count = @club.invoices.count
    processed_transactions = @club.payment_transactions.status_succeeded
    payments_cents = processed_transactions.sum(:amount_cents).to_i
    payments_currency = processed_transactions.pick(:amount_currency) || default_currency
    @payments_total = Money.new(payments_cents, payments_currency)
    member_status_counts = @club.members.group(:status).count.transform_keys(&:to_s)
    @member_status_counts = Member.statuses.keys.index_with { |status| member_status_counts.fetch(status, 0) }
    @membership_questions = @club.membership_questions
    @medical_questions = @club.medical_questions.order(:position, :created_at)
    @club_terms = @club.club_terms.order(:position, :created_at)
    @default_price_tiers = @club.default_price_tiers.ordered
    @membership_types = @club.membership_types.includes(:price_tiers).order(:min_age_years, :label)
    @staggered_payment_plans = policy_scope(@club.staggered_payment_plans.includes(:installments)).order(:name)
---
SELECT COUNT(*) FROM "members" WHERE "members"."club_id" = 'cb3913b7-a251-451c-ac89-09c59a024137'
SELECT COUNT(*) FROM "invoices" WHERE "invoices"."club_id" = 'cb3913b7-a251-451c-ac89-09c59a024137'
SELECT SUM("payments"."amount_cents") FROM "payments" WHERE "payments"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "payments"."status" = 'succeeded'
SELECT COUNT(*) AS "count_all", "members"."status" AS "members_status" FROM "members" WHERE "members"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' GROUP BY "members"."status"
SELECT "medical_questions".* FROM "medical_questions" WHERE "medical_questions"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' ORDER BY "medical_questions"."position" ASC, "medical_questions"."created_at" ASC
SELECT "membership_questions".* FROM "membership_questions" WHERE "membership_questions"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' ORDER BY "membership_questions"."position" ASC, "membership_questions"."created_at" ASC
SELECT "club_terms".* FROM "club_terms" WHERE "club_terms"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' ORDER BY "club_terms"."position" ASC, "club_terms"."created_at" ASC
SELECT "membership_types".* FROM "membership_types" WHERE "membership_types"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' ORDER BY "membership_types"."min_age_years" ASC, "membership_types"."label" ASC
SELECT "staggered_payment_plans".* FROM "staggered_payment_plans" WHERE "staggered_payment_plans"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' ORDER BY "staggered_payment_plans"."name" ASC

  def update
    if @club.update(club_params)
---
UPDATE "clubs" SET "updated_at" = '2025-10-28 12:41:09.231165', "whatsapp_otp_template_id" = '1886655258901505', "whatsapp_order_confirmation_template_id" = '838612878671281' WHERE "clubs"."id" = '81527be2-fd17-46eb-9a97-037af14f24f8'

  def set_club
    @club = Club.find(params[:id])
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = '81527be2-fd17-46eb-9a97-037af14f24f8' LIMIT 1