app/controllers/admin/dashboards_controller.rb

SELECT "clubs".* FROM "clubs" ORDER BY "clubs"."name" ASC LIMIT 10
SELECT "invoices".* FROM "invoices" ORDER BY "invoices"."created_at" DESC LIMIT 10
SELECT "members".* FROM "members" ORDER BY "members"."created_at" DESC LIMIT 10
---
  def show
    authorize! :admin_dashboard, :show?, with: AdminDashboardPolicy

    @clubs = Club.order(:name).limit(10)
    @recent_invoices = Invoice.order(created_at: :desc).limit(10)
    @recent_members = Member.order(created_at: :desc).limit(10)