app/controllers/admin/invoices_controller.rb

SELECT "invoices".* FROM "invoices" ORDER BY "invoices"."created_at" DESC LIMIT 100
---
  def index
    @invoices = Invoice.includes(:club, :member).order(created_at: :desc).limit(100)