app/controllers/admin/members_controller.rb

  def index
    @members = Member.includes(:club).order(:last_name, :first_name)
---
SELECT "members".* FROM "members" ORDER BY "members"."last_name" ASC, "members"."first_name" ASC

  def set_member
    @member = Member.includes(:club, :user).find(params[:id])
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = '81527be2-fd17-46eb-9a97-037af14f24f8'
SELECT "users".* FROM "users" WHERE "users"."id" = 'a8ce4c15-b75a-4b42-805b-d012524d72d2' ORDER BY "users"."id" ASC LIMIT 1