app/controllers/admin/orders_controller.rb

  def index
    authorize! Order, :index?
    @orders = policy_scope(Order).includes(:club, :user, :payment_method).order(created_at: :desc).limit(100)
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC LIMIT 100
SELECT "payment_methods".* FROM "payment_methods" WHERE "payment_methods"."id" IN ('603bd26c-ddb6-4ec5-9490-57140234695b', '7d7400ed-a0e8-4ee1-b149-2bc46a15be6c')
SELECT "users".* FROM "users" WHERE "users"."id" IN ('c40f7358-5921-4e85-93bd-b40a25c2192c', 'b7ba6031-9641-41b6-a7e4-c32a0d78ce56')