app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."staff" = FALSE ORDER BY "users"."email" ASC
---
  def index
    @super_admins = User.where(staff: true).order(:email)