app/controllers/admin/users_controller.rb

  def index
    @users = User.order(:email)
---
SELECT "users".* FROM "users" ORDER BY "users"."email" ASC