app/services/checkouts/submit.rb

    def call
      raise EmptyCartError, "Cart is empty" if cart.cart_items.empty?

      ActiveRecord::Base.transaction do
        order = build_order!
        schedule = nil
        first_installment = nil

        charge_amount_cents = order.total_cents
        if staggered_payment?
          schedule, first_installment = build_staggered_schedule!(order)
          charge_amount_cents = first_installment.amount_cents
        end

        payment_tx = order.payment_transactions.create!(
          status: :initialized,
          gateway: "paygate",
          amount_cents: charge_amount_cents,
          amount_currency: order.total_currency,
          payment_method: payment_method
        )
---
SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = '0eedf927-7d02-460d-b7c8-e922fd324971' LIMIT 1
INSERT INTO "payment_transactions" ("order_id", "payment_method_id", "gateway", "status", "amount_cents", "amount_currency", "request_reference", "response_reference", "request_payload", "response_payload", "metadata", "processed_at", "created_at", "updated_at", "paid_time") VALUES ('1061fc1b-3eba-427f-a0a5-fa3b7ef652de', NULL, 'paygate', 'initialized', 17000, 'ZAR', NULL, NULL, '{}', '{}', '{}', NULL, '2025-10-28 06:40:04.230157', '2025-10-28 06:40:04.230157', NULL) RETURNING "id"

    def build_order!
      subtotal_cents = cart.cart_items.sum(:total_price_cents)
      currency = cart.cart_items.first&.total_price_currency || club_currency

      order = Order.create!(
        club: cart.club,
        user:,
        cart:,
        status: :draft,
        payment_mode: payment_mode || cart.payment_mode || "full",
        staggered_payment_plan: payment_mode.to_s == "staggered" ? (staggered_payment_plan || cart.staggered_payment_plan) : nil,
        subtotal_cents: subtotal_cents,
        subtotal_currency: currency,
        discount_cents: 0,
        discount_currency: currency,
        total_cents: subtotal_cents,
        total_currency: currency
      )

      cart.cart_items.includes(:plan, :member, plan: :product).each do |item|
        order.order_items.create!(
          member: item.member,
          plan: item.plan,
          product: item.plan.product,
          description: item.plan.product&.name,
          quantity: item.quantity,
          unit_price_cents: item.unit_price_cents,
          unit_price_currency: item.unit_price_currency,
          total_price_cents: item.total_price_cents,
          total_price_currency: item.total_price_currency
        )
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = '1061fc1b-3eba-427f-a0a5-fa3b7ef652de'
INSERT INTO "orders" ("club_id", "user_id", "cart_id", "payment_method_id", "status", "number", "external_reference", "subtotal_cents", "subtotal_currency", "discount_cents", "discount_currency", "total_cents", "total_currency", "submitted_at", "paid_at", "metadata", "created_at", "updated_at", "paid_time", "payment_mode", "staggered_payment_plan_id") VALUES ('81527be2-fd17-46eb-9a97-037af14f24f8', 'c40f7358-5921-4e85-93bd-b40a25c2192c', '0eedf927-7d02-460d-b7c8-e922fd324971', NULL, 'draft', 'ORD-20251028-DB2958', NULL, 50000, 'ZAR', 0, 'ZAR', 50000, 'ZAR', NULL, NULL, '{}', '2025-10-28 06:40:04.157130', '2025-10-28 06:40:04.157130', NULL, 'staggered', '298844db-add3-42ce-8cb3-7bf5ac143368') RETURNING "id"