app/services/checkouts/submit.rb

    def persist_tokenized_card(response)
      method = PaymentMethod.find_or_initialize_by(
        club: cart.club,
        user:,
        provider: "paygate",
        external_reference: response.card_token
      )
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = '81527be2-fd17-46eb-9a97-037af14f24f8' LIMIT 1