app/views/members/dashboards/index.html.erb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = '0eedf927-7d02-460d-b7c8-e922fd324971'
---
          <% club = cart.club %>
          <% members = cart.cart_items.map { |item| item.member&.display_name }.compact %>

SELECT "clubs".* FROM "clubs" ORDER BY "clubs"."id" ASC LIMIT 1
SELECT "orders".* FROM "orders" WHERE "orders"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "orders"."cart_id" = '0eedf927-7d02-460d-b7c8-e922fd324971'
---
                            </span>
                            <%= link_to "Pay now",
                                        cart.order ? members_cart_path(club_id: cart.club_id, cart_id: cart.id, order_id: cart.order.id, resume: true) : members_cart_path(club_id: cart.club_id),
                                        class: "inline-flex items-center rounded-full bg-slate-900 px-4 py-1.5 text-xs font-semibold text-white shadow transition hover:bg-slate-800" %>