app/forms/mobile_verification_form.rb

  def submit(params)
    assign_attributes(params)

    return false unless valid?

    user.assign_attributes(
      country_code: normalized_country_code,
      mobile_number: normalized_mobile_number
    )

    if user.changed?
      user.mobile_verified_at = nil
      if user.save
---
UPDATE "users" SET "updated_at" = '2025-10-28 12:49:28.464299', "country_code" = '+27', "mobile_number" = '27825608530' WHERE "users"."id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c'