app/views/admin/orders/index.html.erb

            <td class="px-4 py-3 text-slate-600"><%= order.user.email %></td>
            <td class="px-4 py-3 text-right text-slate-600"><%= order.order_items.sum(:quantity) %></td>
---
SELECT SUM("order_items"."quantity") FROM "order_items" WHERE "order_items"."order_id" = '020d158a-fecc-4851-b167-409f17a239d3'