app/views/members/orders/_summary.html.erb


      <% if @order.order_items.any? %>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = '1061fc1b-3eba-427f-a0a5-fa3b7ef652de'