app/services/membership_registrations/finalize.rb

INSERT INTO "members" ("club_id", "user_id", "first_name", "last_name", "dob", "gender", "role", "medical_info_encrypted", "emergency_contacts_encrypted", "safeguarding_flag", "safeguarding_reason", "created_at", "updated_at", "membership_type_id", "status") VALUES ('81527be2-fd17-46eb-9a97-037af14f24f8', 'c40f7358-5921-4e85-93bd-b40a25c2192c', 'Karel', 'Nel', '2003-08-21', 'Male', 'player', '{"medical_question_23c2ce15-9e9e-4650-ab4b-c611c65f6991":"no"}', '{"primary":{"name":"Nick","number":"0825608530"}}', FALSE, NULL, '2025-10-28 06:37:43.300841', '2025-10-28 06:37:43.300841', 'a3c2a51c-dea2-4a08-b12e-b91c52a094f2', 'unpaid') RETURNING "id"
UPDATE "members" SET "updated_at" = '2025-10-29 09:07:00.671748', "status" = 'unpaid' WHERE "members"."id" = '40c7c592-6920-4c43-ae8d-e725c524e48c'
---
    def call
      ActiveRecord::Base.transaction do
        member = find_or_build_member
        membership_type = resolve_membership_type

        member.assign_attributes(member_attributes(membership_type))
        member.save!

SELECT "membership_types".* FROM "membership_types" WHERE "membership_types"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "membership_types"."id" = 'a3c2a51c-dea2-4a08-b12e-b91c52a094f2' LIMIT 1
---
    def resolve_membership_type
      return @membership_type if defined?(@membership_type)

      @membership_type = club.membership_types.find(form.membership_type_id)

SELECT "members".* FROM "members" WHERE "members"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "members"."id" = '40c7c592-6920-4c43-ae8d-e725c524e48c' LIMIT 1
---
    def find_or_build_member
      return @member if defined?(@member)

      if form.member_id.present?
        @member = club.members.find(form.member_id)

SELECT "guardianships".* FROM "guardianships" WHERE "guardianships"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "guardianships"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "guardianships"."member_id" = '40c7c592-6920-4c43-ae8d-e725c524e48c' AND "guardianships"."guardian_id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c' LIMIT 1
---
    def ensure_guardianship(member)
      return unless user

      guardianship = Guardianship.find_or_initialize_by(club:, member:, guardian: user)

SELECT "membership_question_responses".* FROM "membership_question_responses" WHERE "membership_question_responses"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "membership_question_responses"."membership_question_id" = '3f2dc22b-e89e-4d20-a254-7e9ccacb1041' AND "membership_question_responses"."member_id" = '40c7c592-6920-4c43-ae8d-e725c524e48c' LIMIT 1
---
    def persist_membership_question_responses(member)
      questions = club.membership_questions.index_by { |q| q.id.to_s }

      form.survey_responses.each do |question_id, value|
        question = questions[question_id]
        next unless question

        if value.blank?
          if question.required?
            value = ""
          else
            MembershipQuestionResponse.where(club:, membership_question: question, member: member).delete_all
            next
          end
        end

        response = MembershipQuestionResponse.find_or_initialize_by(
          club: club,
          membership_question: question,
          member: member
        )

SELECT "club_term_acceptances".* FROM "club_term_acceptances" WHERE "club_term_acceptances"."club_term_id" = '856d83c6-09c8-4654-ad2f-0c29095c7d03' AND "club_term_acceptances"."member_id" = '40c7c592-6920-4c43-ae8d-e725c524e48c' LIMIT 1
INSERT INTO "club_term_acceptances" ("club_term_id", "member_id", "accepted_at", "accepted_by_id", "created_at", "updated_at") VALUES ('856d83c6-09c8-4654-ad2f-0c29095c7d03', '40c7c592-6920-4c43-ae8d-e725c524e48c', '2025-10-28 06:37:43.365755', 'c40f7358-5921-4e85-93bd-b40a25c2192c', '2025-10-28 06:37:43.368864', '2025-10-28 06:37:43.368864') RETURNING "id"
---
    def persist_term_acceptances(member)
      club_terms = club.club_terms.active.index_by(&:id)

      club_terms.each_value do |term|
        accepted = form.accepted_term?(term)
        acceptance = ClubTermAcceptance.find_by(club_term: term, member: member)

        if accepted
          acceptance ||= ClubTermAcceptance.new(club_term: term, member: member)
          acceptance.accepted_at ||= Time.current
          acceptance.accepted_by ||= user
          acceptance.save!

INSERT INTO "carts" ("club_id", "user_id", "status", "expires_at", "checked_out_at", "metadata", "created_at", "updated_at", "payment_mode", "staggered_payment_plan_id") VALUES ('81527be2-fd17-46eb-9a97-037af14f24f8', 'c40f7358-5921-4e85-93bd-b40a25c2192c', 'unpaid', NULL, NULL, '{}', '2025-10-28 06:37:43.413168', '2025-10-28 06:37:43.413168', 'full', NULL) RETURNING "id"
---
    def ensure_cart
      @cart ||= Cart.unpaid.find_by(user:, club:) || Cart.create!(user:, club:)

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = '0eedf927-7d02-460d-b7c8-e922fd324971' AND "cart_items"."member_id" = '40c7c592-6920-4c43-ae8d-e725c524e48c' AND "cart_items"."plan_id" = '79c7f228-6034-4b30-8b0a-b39cb7d5237e' LIMIT 1
---
    def ensure_cart_item(cart, member, plan)
      item = cart.cart_items.find_or_initialize_by(member:, plan:)

SELECT "products".* FROM "products" WHERE "products"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "products"."id" = '1f1c0e21-5b53-4d63-bd80-2cc0385eb078' LIMIT 1
---
    def ensure_plan(membership_type)
      plan = membership_type.plan
      price = membership_type.current_price

      product = if plan&.product
                  plan.product
      else
                  club.products.find_or_initialize_by(sku: product_sku(membership_type))