app/views/admin/clubs/_form.html.erb


    <div class="<%= @club.membership_questions.any? ? "hidden" : "" %> text-sm text-slate-500" data-club-questions-target="emptyState">
---
SELECT 1 AS one FROM "membership_questions" WHERE "membership_questions"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' LIMIT 1