app/views/admin/clubs/index.html.erb

SELECT "members".* FROM "members" WHERE "members"."club_id" IN ('cb3913b7-a251-451c-ac89-09c59a024137', '81527be2-fd17-46eb-9a97-037af14f24f8')
---
          <td class="px-4 py-3 text-slate-600"><%= club.primary_domain.presence || club.subdomain.presence || "—" %></td>
          <td class="px-4 py-3 text-slate-600"><%= club.members.size %></td>