app/views/admin/clubs/show.html.erb

SELECT COUNT(*) FROM "club_default_price_tiers" WHERE "club_default_price_tiers"."club_id" = 'cb3913b7-a251-451c-ac89-09c59a024137'
SELECT COUNT(*) FROM "membership_types" WHERE "membership_types"."club_id" = 'cb3913b7-a251-451c-ac89-09c59a024137'
SELECT 1 AS one FROM "club_default_price_tiers" WHERE "club_default_price_tiers"."club_id" = 'cb3913b7-a251-451c-ac89-09c59a024137' LIMIT 1
SELECT 1 AS one FROM "membership_types" WHERE "membership_types"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' LIMIT 1
---
  }
  setup_checks = [
    {
      key: :default_price_tiers,
      title: "Default price tiers",
      description: "Capture your standard season dates so new membership types start with matching tiers.",
      count: @default_price_tiers.size,
      unit: "tier",
      completed: @default_price_tiers.any?,
      required: false
    },
    {
      key: :whatsapp_messaging,
      title: "WhatsApp messaging",
      description: "Connect WhatsApp so members receive real-time transactional updates.",
      count: @whatsapp_templates.size,
      unit: "template",
      completed: @whatsapp_client.ready?,
      required: false
    },
    {
      key: :membership_types,
      title: "Personal & memberships",
      description: "Define who can join and the pricing options members see on the personal step.",
      count: @membership_types.size,
      unit: "type",
      completed: @membership_types.any?,
      required: true

SELECT 1 AS one FROM "medical_questions" WHERE "medical_questions"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' LIMIT 1
---
    {
      key: :medical_questions,
      title: "Medical questions",
      description: "Capture the health information you need before members can continue.",
      count: @medical_questions.size,
      unit: "question",
      completed: @medical_questions.any?,
      required: false

SELECT 1 AS one FROM "membership_questions" WHERE "membership_questions"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' LIMIT 1
---
    {
      key: :membership_questions,
      title: "Survey questions",
      description: "Ask the custom questions that appear on the survey step.",
      count: @membership_questions.size,
      unit: "question",
      completed: @membership_questions.any?,
      required: false

SELECT 1 AS one FROM "club_terms" WHERE "club_terms"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' LIMIT 1
---
    {
      key: :club_terms,
      title: "Terms & conditions",
      description: "List the agreements members must accept before checkout.",
      count: @club_terms.size,
      unit: "term",
      completed: @club_terms.any?,
      required: true

SELECT 1 AS one FROM "staggered_payment_plans" WHERE "staggered_payment_plans"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' LIMIT 1
---
    {
      key: :staggered_payment_plans,
      title: "Payment options",
      description: "Offer staggered payment plans to give members flexibility at checkout.",
      count: @staggered_payment_plans.size,
      unit: "plan",
      completed: @staggered_payment_plans.any?,
      required: false