app/services/notifications/mobile_verification_notifier.rb

    def user_primary_club
      @user_primary_club ||= user.clubs.first
---
SELECT "clubs".* FROM "clubs" INNER JOIN "club_roles" ON "clubs"."id" = "club_roles"."club_id" WHERE "club_roles"."user_id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c' ORDER BY "clubs"."id" ASC LIMIT 1