app/services/notifications/order_confirmation_notifier.rb

SELECT SUM("payment_transactions"."amount_cents") FROM "payment_transactions" WHERE "payment_transactions"."order_id" = '51a7e09a-c3da-4c42-9ce8-9389814354e9' AND "payment_transactions"."status" = 'succeeded'
SELECT SUM("payment_transactions"."amount_cents") FROM "payment_transactions" WHERE "payment_transactions"."order_id" = '1061fc1b-3eba-427f-a0a5-fa3b7ef652de' AND "payment_transactions"."status" = 'succeeded'
---
    def remaining_balance_cents
      return 0 unless order.total_cents

      paid_cents =
        if order.payment_transactions.loaded?
          order.payment_transactions
            .select(&:status_succeeded?)
            .sum { |tx| tx.amount_cents.to_i }
        else
          order.payment_transactions.status_succeeded.sum(:amount_cents).to_i
        end

      [ order.total_cents - paid_cents, 0 ].max