app/helpers/application_helper.rb

  def membership_sentence(order, style: :chicago, oxford_comma: true)
    names = Array.wrap(order.members)
                .map { |m| m.first_name.presence }
                .compact
---
SELECT "members".* FROM "members" INNER JOIN "order_items" ON "members"."id" = "order_items"."member_id" WHERE "order_items"."order_id" = '1061fc1b-3eba-427f-a0a5-fa3b7ef652de'