app/controllers/members/application_controller.rb

  def current_cart
    return nil unless current_user

    club = current_club
    return nil unless club

    @current_carts ||= {}
    @current_carts[club.id] ||= Cart.unpaid.find_by(user: current_user, club:) || Cart.create!(user: current_user, club:)
---
INSERT INTO "carts" ("club_id", "user_id", "status", "expires_at", "checked_out_at", "metadata", "created_at", "updated_at", "payment_mode", "staggered_payment_plan_id") VALUES ('81527be2-fd17-46eb-9a97-037af14f24f8', 'c40f7358-5921-4e85-93bd-b40a25c2192c', 'unpaid', NULL, NULL, '{}', '2025-10-28 06:40:08.165274', '2025-10-28 06:40:08.165274', 'full', NULL) RETURNING "id"

  def manageable_members
    return Member.none unless current_user

    club = current_club
    return Member.none unless club

    member_ids = current_user.members.where(club:).pluck(:id)
    guardian_ids = current_user.guarded_members.where(club:).pluck(:id)
---
SELECT "members"."id" FROM "members" WHERE "members"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "members"."user_id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c' AND "members"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8'
SELECT "members"."id" FROM "members" INNER JOIN "guardianships" ON "members"."id" = "guardianships"."member_id" WHERE "members"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "guardianships"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "guardianships"."guardian_id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c' AND "members"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8'