app/controllers/members/carts_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = '0eedf927-7d02-460d-b7c8-e922fd324971' ORDER BY "cart_items"."id" ASC LIMIT 1
SELECT "clubs".* FROM "clubs" ORDER BY "clubs"."id" ASC LIMIT 1
SELECT "membership_types".* FROM "membership_types" WHERE "membership_types"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "membership_types"."id" = 'a3c2a51c-dea2-4a08-b12e-b91c52a094f2'
SELECT "products".* FROM "products" WHERE "products"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "products"."id" = '1f1c0e21-5b53-4d63-bd80-2cc0385eb078'
SELECT "plans".* FROM "plans" WHERE "plans"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "plans"."id" = '79c7f228-6034-4b30-8b0a-b39cb7d5237e'
SELECT "staggered_payment_plans".* FROM "staggered_payment_plans" WHERE "staggered_payment_plans"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "staggered_payment_plans"."id" = '298844db-add3-42ce-8cb3-7bf5ac143368' LIMIT 1
SELECT "orders".* FROM "orders" WHERE "orders"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "orders"."cart_id" = '0eedf927-7d02-460d-b7c8-e922fd324971' LIMIT 1
SELECT "staggered_payment_schedules".* FROM "staggered_payment_schedules" WHERE "staggered_payment_schedules"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "staggered_payment_schedules"."order_id" = '1061fc1b-3eba-427f-a0a5-fa3b7ef652de' LIMIT 1
---
  def show
    @cart = requested_cart || current_cart
    unless @cart&.user_id == current_user&.id
      redirect_to members_dashboards_path, alert: "We couldn't find that cart." and return
    end

    authorize! @cart, :show?

    @cart_items = @cart.cart_items.includes(member: [ :club, :membership_type ], plan: :product)
    @available_members = manageable_members
    @payment_methods = policy_scope(PaymentMethod)
                         .where(club: @club)
                         .usable
                         .order(default: :desc, created_at: :desc)

    @selected_payment_mode = @cart.payment_mode.presence || "full"
    @selected_payment_plan_id = @cart.staggered_payment_plan_id
    @selected_payment_plan = @club.staggered_payment_plans.find_by(id: @selected_payment_plan_id)

    unless @selected_payment_plan
      @selected_payment_plan_id = nil
      @selected_payment_mode = "full"
    end

    @cart_total_money = @cart.full_total_money
    @base_price = @cart.base_price_total(cart_items: @cart_items)
    @staggered_total_money = @base_price || @cart_total_money
    @selected_plan_breakdown = build_plan_breakdown(@selected_payment_plan, @base_price)
    @staggered_schedule = @cart.order&.staggered_payment_schedule