app/controllers/members/checkouts_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = '0eedf927-7d02-460d-b7c8-e922fd324971' ORDER BY "cart_items"."id" ASC LIMIT 1
SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = '0eedf927-7d02-460d-b7c8-e922fd324971' LIMIT 1
SELECT "plans".* FROM "plans" WHERE "plans"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "plans"."id" = '79c7f228-6034-4b30-8b0a-b39cb7d5237e'
SELECT "staggered_payment_plans".* FROM "staggered_payment_plans" WHERE "staggered_payment_plans"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "staggered_payment_plans"."id" = '298844db-add3-42ce-8cb3-7bf5ac143368' LIMIT 1
UPDATE "carts" SET "updated_at" = '2025-10-28 06:40:07.741120', "status" = 'partially_paid', "checked_out_at" = '2025-10-28 06:40:07.740783' WHERE "carts"."id" = '0eedf927-7d02-460d-b7c8-e922fd324971'
---
  def create
    authorize! @cart, :update?

    if @cart.cart_items.empty?
      redirect_to members_cart_redirect_path, alert: "Your cart is empty."
      return
    end

    checkout = checkout_params
    payment_source = checkout[:payment_source].presence || (policy_scope(PaymentMethod).usable.where(club: @club).exists? ? "saved" : "new")

    payment_mode = checkout[:payment_mode].presence_in(%w[full staggered]) || @cart.payment_mode.presence || "full"
    selected_plan = @cart.staggered_payment_plan if @cart.payment_mode == "staggered"

    if payment_mode == "staggered"
      plan_id = checkout[:staggered_payment_plan_id].presence || selected_plan&.id
      selected_plan = @club.staggered_payment_plans.find_by(id: plan_id)
      unless selected_plan
        redirect_to members_cart_redirect_path, alert: "Please select a valid staggered payment plan." and return
      end
    else
      selected_plan = nil
    end

    unless @cart.update(payment_mode:, staggered_payment_plan: selected_plan)

SELECT "orders".* FROM "orders" WHERE "orders"."id" = '1061fc1b-3eba-427f-a0a5-fa3b7ef652de' LIMIT 1
---
      staggered_payment_plan: selected_plan
    ).call

    if result.order.status_paid?

SELECT "members".* FROM "members" INNER JOIN "order_items" ON "members"."id" = "order_items"."member_id" WHERE "order_items"."order_id" = '51a7e09a-c3da-4c42-9ce8-9389814354e9'
SELECT "payment_transactions".* FROM "payment_transactions" WHERE "payment_transactions"."order_id" = '1061fc1b-3eba-427f-a0a5-fa3b7ef652de'
---
  def success
    reference = params[:reference].to_s.strip
    if reference.blank?
      redirect_to members_cart_redirect_path, alert: "We couldn't find that payment confirmation."
      return
    end

    @order = policy_scope(Order)
              .includes(:payment_method, :user, :payment_transactions, order_items: [:member, { plan: :product }])
              .find_by("UPPER(orders.number) = ?", reference.upcase)