app/controllers/members/dashboards_controller.rb

SELECT "clubs".* FROM "clubs" INNER JOIN "club_roles" ON "clubs"."id" = "club_roles"."club_id" WHERE "club_roles"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "club_roles"."user_id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c'
SELECT "members".* FROM "members" WHERE "members"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "members"."user_id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c'
SELECT "members".* FROM "members" INNER JOIN "guardianships" ON "members"."id" = "guardianships"."member_id" WHERE "members"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "guardianships"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "guardianships"."guardian_id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c'
---
  def index
    direct_members = current_user.members.includes(:club).status_active
    guardian_members = current_user.guarded_members.includes(:club).status_active

    @membership_profiles = (direct_members.to_a + guardian_members.to_a).uniq { |member| member.id }
    @known_clubs = (@membership_profiles.map(&:club) + current_user.clubs.to_a).compact.uniq { |club| club.id }

SELECT "clubs".* FROM "clubs" INNER JOIN "club_roles" ON "clubs"."id" = "club_roles"."club_id" WHERE "club_roles"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "club_roles"."user_id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c'
SELECT "members".* FROM "members" WHERE "members"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "members"."user_id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c'
SELECT "members".* FROM "members" INNER JOIN "guardianships" ON "members"."id" = "guardianships"."member_id" WHERE "members"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "guardianships"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "guardianships"."guardian_id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c'
---
  def show
    direct_members = current_user.members.includes(:club).status_active
    guardian_members = current_user.guarded_members.includes(:club).status_active

    @membership_profiles = (direct_members.to_a + guardian_members.to_a).uniq { |member| member.id }
    @known_clubs = (@membership_profiles.map(&:club) + current_user.clubs.to_a).compact.uniq { |club| club.id }