app/controllers/members/membership_registrations_controller.rb

  def ensure_club_selected!
    session[:membership_registration] ||= {}
    session[:membership_registration][current_user_session_key] ||= {}

    if params[:club_id].present?
      session[:membership_registration][current_user_session_key][:club_id] = params[:club_id]
    end

    unless selected_club_id
      redirect_to members_dashboards_path, alert: "Please choose a club to start a membership." and return
    end

    @club = Club.find(selected_club_id)
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = '81527be2-fd17-46eb-9a97-037af14f24f8' LIMIT 1

  def prepare_personal_step
    return unless @step == "personal"

    @available_profiles = current_user.members.includes(:club).order(:first_name, :last_name, :created_at)

    requested_phase = params[:phase]
    selected_profile_id = params[:profile_member_id].presence

    if selected_profile_id
      profile = @available_profiles.find { |member| member.id.to_s == selected_profile_id }
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = '81527be2-fd17-46eb-9a97-037af14f24f8'
SELECT "members".* FROM "members" WHERE "members"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "members"."user_id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c' ORDER BY "members"."first_name" ASC, "members"."last_name" ASC, "members"."created_at" ASC

  def process_payment_option_step
    return unless ensure_membership_finalized!

    form_params = params.fetch(:membership_registration_form, {}).permit(:payment_mode, :staggered_payment_plan_id)
    payment_mode = form_params[:payment_mode].presence_in(%w[full staggered]) || "full"

    cart = @cart || current_cart
    selected_plan = nil

    if payment_mode == "staggered"
      selected_plan = available_payment_plans.find_by(id: form_params[:staggered_payment_plan_id])
      unless selected_plan
        flash.now[:alert] = "Please select a valid payment plan."
        prepare_payment_option_step
        render template_for_step, status: :unprocessable_entity
        return
      end
    end

    unless cart.update(payment_mode:, staggered_payment_plan: selected_plan)
---
UPDATE "carts" SET "updated_at" = '2025-10-28 06:38:29.051944', "payment_mode" = 'staggered', "staggered_payment_plan_id" = '298844db-add3-42ce-8cb3-7bf5ac143368' WHERE "carts"."id" = '0eedf927-7d02-460d-b7c8-e922fd324971'

  def ensure_membership_finalized!
    return true if defined?(@finalization_attempted) && @finalization_attempted

    existing_cart = nil

    if @form.cart_id.present?
      existing_cart = Cart.find_by(id: @form.cart_id, user: current_user)
      if existing_cart&.club_id == @club.id && existing_cart.status_unpaid?
        hydrate_cart_context(existing_cart)
        @finalization_attempted = true
        return true
      elsif existing_cart
        @form.cart_id = nil
        @form.cart_item_id = nil
        store_registration_data(@form.to_session)
        existing_cart = nil
      end
    end

    if existing_cart.nil? && params[:cart_id].present?
---
SELECT "carts".* FROM "carts" WHERE "carts"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "carts"."id" = '0eedf927-7d02-460d-b7c8-e922fd324971' AND "carts"."user_id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c' LIMIT 1

  def hydrate_cart_context(cart, highlighted_item: nil)
    @current_cart = @cart = cart
    @cart_items = cart.cart_items.includes({ member: :membership_type }, plan: :product)
    @highlighted_cart_item = highlighted_item || cart.cart_items.find_by(id: @form.cart_item_id)
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = '0eedf927-7d02-460d-b7c8-e922fd324971' AND "cart_items"."id" = 'b3cfb40a-1fac-4937-81f6-960b82763900' LIMIT 1