app/controllers/members/orders_controller.rb

    scope = policy_scope(Order)
              .includes(
                :club,
                :payment_method,
                :user,
                { payment_transactions: :payment_method },
                { order_items: [:member, { plan: :product }] },
                { staggered_payment_schedule: :installments }
              )
---
SELECT "clubs".* FROM "clubs" ORDER BY "clubs"."id" ASC LIMIT 1
SELECT "members".* FROM "members" WHERE "members"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "members"."id" = '40c7c592-6920-4c43-ae8d-e725c524e48c'
SELECT "payment_methods".* FROM "payment_methods" WHERE "payment_methods"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "payment_methods"."id" = '603bd26c-ddb6-4ec5-9490-57140234695b'
SELECT "products".* FROM "products" WHERE "products"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "products"."id" = '1f1c0e21-5b53-4d63-bd80-2cc0385eb078'