app/controllers/application_controller.rb

SELECT "clubs".* FROM "clubs" WHERE "clubs"."primary_domain" = 'localhost' LIMIT 1
---
  def resolve_club_from_request
    if (impersonated = session[:impersonated_club_id])
      club = Club.find_by(id: impersonated)
      return club if club
    end

    host = request.host
    domain = host.split(":").first
    subdomain = request.subdomains.first

    Club.find_by(primary_domain: domain) ||
      Club.find_by(subdomain:) ||
      Club.first