app/controllers/application_controller.rb

  def default_signed_in_path_for(resource)
    if resource.respond_to?(:staff?) && resource.staff?
      admin_dashboard_path
    elsif resource.respond_to?(:club_roles) && resource.club_roles.exists?
---
SELECT "clubs".* FROM "clubs" ORDER BY "clubs"."id" ASC LIMIT 1

  def resolve_club_from_request
    if (impersonated = session[:impersonated_club_id])
      club = Club.find_by_param(impersonated)
      return club if club
    end

    host = request.host
    domain = host.split(":").first
    subdomain = request.subdomains.first

    Club.find_by(primary_domain: domain) ||
      Club.find_by(subdomain:) ||
      Club.first
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."primary_domain" = 'f5f4eb27480b.ngrok-free.app' LIMIT 1