app/controllers/concerns/members/cart_context.rb

  def resolve_cart_club
    return requested_cart.club if requested_cart
    return Club.find_by(id: params[:club_id]) if params[:club_id].present?
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = '81527be2-fd17-46eb-9a97-037af14f24f8' LIMIT 1

  def requested_cart
    return @requested_cart if defined?(@requested_cart)

    cart = nil

    if params[:cart_id].present?
      cart = Cart.where(user: current_user).includes(:club).find_by(id: params[:cart_id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "carts"."user_id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c' AND "carts"."id" = '0eedf927-7d02-460d-b7c8-e922fd324971' LIMIT 1