app/controllers/concerns/members/order_summary.rb

    def prepare_order_summary(order, payment_transaction: nil)
      @order = order
      @club ||= order.club

      @payment_transaction =
        payment_transaction ||
        order.payment_transactions.status_succeeded.order(processed_at: :desc, updated_at: :desc, created_at: :desc).first ||
        order.payment_transactions.order(processed_at: :desc, updated_at: :desc, created_at: :desc).first
---
SELECT "payment_transactions".* FROM "payment_transactions" WHERE "payment_transactions"."order_id" = '1061fc1b-3eba-427f-a0a5-fa3b7ef652de' AND "payment_transactions"."status" = 'succeeded' ORDER BY "payment_transactions"."processed_at" DESC, "payment_transactions"."updated_at" DESC, "payment_transactions"."created_at" DESC LIMIT 1