app/models/cart.rb

  def mark_as_paid!(paid_time)
    paid_time ||= Time.current
    return if status_paid?

    transaction do
      update!(
        status: :paid,
        checked_out_at: paid_time
      )

      members.distinct.compact.each do |member|
        member.update!(status: :active)
        ActiveSupport::Notifications.instrument("membership.paid", member_id: member.id, club_id: club_id)
      end

      cart_items.destroy_all
---
UPDATE "carts" SET "updated_at" = '2025-10-29 07:06:40.644124', "status" = 'paid', "checked_out_at" = '2025-10-29 07:06:40.641911' WHERE "carts"."id" = '0eedf927-7d02-460d-b7c8-e922fd324971'
UPDATE "members" SET "updated_at" = '2025-10-29 07:06:40.646757', "status" = 'active' WHERE "members"."id" = '40c7c592-6920-4c43-ae8d-e725c524e48c'
DELETE FROM "cart_items" WHERE "cart_items"."id" = 'b3cfb40a-1fac-4937-81f6-960b82763900'

  def mark_as_partially_paid!(checkout_time = Time.current)
    checkout_time ||= Time.current
    return if status_paid?

    transaction do
      update!(
        status: :partially_paid,
        checked_out_at: checkout_time
      )

      members.distinct.compact.each do |member|
        member.update!(status: :partially_paid)
---
UPDATE "carts" SET "updated_at" = '2025-10-28 06:40:07.741120', "status" = 'partially_paid', "checked_out_at" = '2025-10-28 06:40:07.740783' WHERE "carts"."id" = '0eedf927-7d02-460d-b7c8-e922fd324971'
UPDATE "members" SET "updated_at" = '2025-10-28 06:40:07.746625', "status" = 'partially_paid' WHERE "members"."id" = '40c7c592-6920-4c43-ae8d-e725c524e48c'

  def prepare_pricing_items(items = nil)
    if items
      Array.wrap(items)
    else
      association = self.cart_items.includes(member: :membership_type)
      association.to_a
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = '0eedf927-7d02-460d-b7c8-e922fd324971'