app/models/club.rb

  def self.find_by_param(value)
    return if value.blank?

    friendly.find(value)
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = '81527be2-fd17-46eb-9a97-037af14f24f8' LIMIT 1