app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."provider" = 'google_oauth2' AND "users"."uid" = '115533676829795323517' LIMIT 1
---
  def self.from_omniauth(auth)
    user = find_by(provider: auth.provider, uid: auth.uid) || find_by(email: auth.info.email)
    user ||= new

    user.provider = auth.provider
    user.uid = auth.uid
    user.skip_terms_validation = true
    user.terms_agreement = true

    user.assign_attributes(
      email: auth.info.email,
      first_name: auth.info.first_name.presence || auth.info.name.to_s.split.first,
      last_name: auth.info.last_name.presence || auth.info.name.to_s.split.drop(1).join(" "),
      oauth_data: auth.to_h
    )