app/views/admin/clubs/memberships/index.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."id" IN ('1061fc1b-3eba-427f-a0a5-fa3b7ef652de', '020d158a-fecc-4851-b167-409f17a239d3')
---
            <% member = purchase.member %>
            <% order = purchase.order %>