app/views/admin/clubs/memberships/show.html.erb

        </div>
        <% if member&.user&.email.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c' LIMIT 1