app/controllers/users/omniauth_callbacks_controller.rb

  def default_redirect_for(user)
    if user.respond_to?(:staff?) && user.staff?
      main_app.admin_dashboard_path
    elsif user.respond_to?(:club_roles) && user.club_roles.exists?
---
SELECT 1 AS one FROM "club_roles" WHERE "club_roles"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "club_roles"."user_id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c' LIMIT 1