app/controllers/users/registrations_controller.rb

  def set_club
    @club = Club.find_by_id(params["club_id"])
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" IS NULL LIMIT 1