app/controllers/users/sessions_controller.rb

SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" IS NULL LIMIT 1
---
  def set_club
    @club = Club.find_by_id(params[:club_id])