app/controllers/admin/clubs/default_price_tiers_controller.rb

INSERT INTO "club_default_price_tiers" ("club_id", "label", "starts_on", "ends_on", "position", "created_at", "updated_at") VALUES ('cb3913b7-a251-451c-ac89-09c59a024137', 'Early Brid', '2025-10-01', '2026-02-28', 0, '2025-10-27 14:44:56.364108', '2025-10-27 14:44:56.364108') RETURNING "id"
---
  def create
    @default_price_tier = @club.default_price_tiers.build(default_price_tier_params)
    authorize! @default_price_tier

    if @default_price_tier.save

SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = 'cb3913b7-a251-451c-ac89-09c59a024137' LIMIT 1
---
  def set_club
    @club = Club.find(params[:club_id])