app/controllers/admin/clubs/medical_questions_controller.rb

  def set_club
    @club = Club.find(params[:club_id])
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = '81527be2-fd17-46eb-9a97-037af14f24f8' LIMIT 1