app/controllers/admin/clubs/memberships_controller.rb

SELECT "members".* FROM "members" WHERE "members"."id" IN ('40c7c592-6920-4c43-ae8d-e725c524e48c', 'e16bb9d1-eb5c-4b10-8cf4-080c0352ef88')
SELECT "order_items".* FROM "order_items" INNER JOIN "orders" ON "orders"."id" = "order_items"."order_id" WHERE "orders"."club_id" = 'cb3913b7-a251-451c-ac89-09c59a024137' ORDER BY order_items.created_at DESC
SELECT "orders".* FROM "orders" WHERE "orders"."id" IN ('1061fc1b-3eba-427f-a0a5-fa3b7ef652de', '020d158a-fecc-4851-b167-409f17a239d3')
SELECT "payment_methods".* FROM "payment_methods" WHERE "payment_methods"."id" IN ('7d7400ed-a0e8-4ee1-b149-2bc46a15be6c', '603bd26c-ddb6-4ec5-9490-57140234695b')
---
  def index
    authorize! Order, :index?
    @purchases = OrderItem
                   .includes(:member, plan: :product, order: :payment_method)
                   .joins(:order)
                   .where(orders: { club_id: @club.id })
                   .order("order_items.created_at DESC")

SELECT "payment_transactions".* FROM "payment_transactions" WHERE "payment_transactions"."order_id" = '1061fc1b-3eba-427f-a0a5-fa3b7ef652de' ORDER BY "payment_transactions"."processed_at" DESC, "payment_transactions"."created_at" DESC
SELECT "guardianships".* FROM "guardianships" WHERE "guardianships"."member_id" = '40c7c592-6920-4c43-ae8d-e725c524e48c'
SELECT "membership_question_responses".* FROM "membership_question_responses" WHERE "membership_question_responses"."member_id" = '40c7c592-6920-4c43-ae8d-e725c524e48c'
SELECT "membership_questions".* FROM "membership_questions" WHERE "membership_questions"."id" IN ('3f2dc22b-e89e-4d20-a254-7e9ccacb1041', 'b67e0c69-404c-4c62-9082-2f90f48397b6')
---
  def show
    authorize! @order
    @transactions = @order.payment_transactions.includes(:payment_method).order(processed_at: :desc, created_at: :desc)
    @guardians = @member&.guardianships&.includes(:guardian) || []
    @question_responses = @member&.membership_question_responses&.includes(:membership_question) || []

SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = 'cb3913b7-a251-451c-ac89-09c59a024137' LIMIT 1
---
  def set_club
    @club = Club.find(params[:club_id])

SELECT "members".* FROM "members" WHERE "members"."id" = '40c7c592-6920-4c43-ae8d-e725c524e48c'
SELECT "orders".* FROM "orders" WHERE "orders"."id" = '1061fc1b-3eba-427f-a0a5-fa3b7ef652de'
SELECT "payment_methods".* FROM "payment_methods" WHERE "payment_methods"."id" = '603bd26c-ddb6-4ec5-9490-57140234695b'
SELECT "products".* FROM "products" WHERE "products"."id" = '1f1c0e21-5b53-4d63-bd80-2cc0385eb078'
---
  def set_membership
    @order_item = OrderItem
                    .includes(:member, plan: :product, order: :payment_method)
                    .joins(:order)
                    .where(orders: { club_id: @club.id })
                    .find(params[:id])
    @order = @order_item.order