app/controllers/admin/clubs/membership_types_controller.rb

SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = 'cb3913b7-a251-451c-ac89-09c59a024137' LIMIT 1
---
  def set_club
    @club = Club.find(params[:club_id])