app/controllers/admin/clubs/membership_types_controller.rb

INSERT INTO "membership_types" ("club_id", "label", "min_age_years", "max_age_years", "gender", "base_price_cents", "base_price_currency", "metadata", "created_at", "updated_at", "plan_id") VALUES ('cb3913b7-a251-451c-ac89-09c59a024137', 'U7', 6, 7, 'female', 20000, 'ZAR', '{}', '2025-10-27 14:45:51.103825', '2025-10-27 14:45:51.103825', NULL) RETURNING "id"
---
  def create
    @membership_type = @club.membership_types.build(membership_type_params)

    if @membership_type.save

SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = 'cb3913b7-a251-451c-ac89-09c59a024137' LIMIT 1
---
  def set_club
    @club = Club.find(params[:club_id])