app/controllers/admin/clubs/terms_controller.rb

SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = '81527be2-fd17-46eb-9a97-037af14f24f8' LIMIT 1
---
  def set_club
    @club = Club.find(params[:club_id])