app/controllers/admin/clubs/membership_types/price_tiers_controller.rb

  def set_club
    @club = Club.find(params[:club_id])
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = '81527be2-fd17-46eb-9a97-037af14f24f8' LIMIT 1

  def set_membership_type
    @membership_type = @club.membership_types.find(params[:membership_type_id])
---
SELECT "membership_types".* FROM "membership_types" WHERE "membership_types"."club_id" = '81527be2-fd17-46eb-9a97-037af14f24f8' AND "membership_types"."id" = 'a23f452d-3cc0-47e0-a010-d46cd87d6d83' LIMIT 1