app/jobs/send_mobile_verification_job.rb

  def perform(user_id, code)
    user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c' LIMIT 1