app/jobs/send_order_confirmation_job.rb

  def perform(order_id, payment_transaction_id = nil, installment_id = nil)
    order = Order.includes(:club, :user, :staggered_payment_schedule).find_by(id: order_id)
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = '81527be2-fd17-46eb-9a97-037af14f24f8'
SELECT "orders".* FROM "orders" WHERE "orders"."id" = '1061fc1b-3eba-427f-a0a5-fa3b7ef652de' LIMIT 1
SELECT "staggered_payment_schedules".* FROM "staggered_payment_schedules" WHERE "staggered_payment_schedules"."order_id" = '1061fc1b-3eba-427f-a0a5-fa3b7ef652de'
SELECT "users".* FROM "users" WHERE "users"."id" = 'c40f7358-5921-4e85-93bd-b40a25c2192c'

  def resolve_payment_transaction(order, payment_transaction_id, installment_id)
    return PaymentTransaction.find_by(id: payment_transaction_id) if payment_transaction_id
---
SELECT "payment_transactions".* FROM "payment_transactions" WHERE "payment_transactions"."id" = 'fb364290-e901-4a71-b76d-f527499d7d2e' LIMIT 1